<?php
/**
 * @Author: Coly Cao
 * @Date:   2017-02-04 16:25:28
 * @Last Modified by:   Coly Cao
 * @Last Modified time: 2017-03-10 09:43:58
 */
namespace Colyii\Fuiou\pc;

use Illuminate\Support\Facades\Log;

class HelperFunction
{
    //调外部接口，拼接 HTML
    public static function buildForm($arr_parameter, $url)
    {
        $sHtml = "<form id='payform' name='payform' accept-charset='utf-8' onsubmit=\"document.charset='utf-8';\" action='" . $url . "' method='post', target=''>";

        while (list($key, $val) = each($arr_parameter)) {
            $sHtml .= "<input type='hidden' name='" . $key . "' value='" . $val . "'/>";
        }

        //submit按钮控件请不要含有name属性
        $sHtml = $sHtml . "<input type='submit' value='确认付款' style='display: none;'></form>";
        $sHtml = $sHtml . "<script>document.forms['payform'].submit();</script>";

        return $sHtml;
    }

    //生成唯一不重复订单号
    public static function buildOn()
    {
        return date('Ymd') . substr(implode(null, array_map('ord', str_split(substr(uniqid(), 7, 13), 1))), 0, 12);
    }

    public static function pinjieRsasign($data, $url)
    {
        ksort($data);
        if ('authConfig' == $url || 'app/authConfig' == $url) {
            end($data);
            $last_key = key($data);
            $last_value = array_pop($data);
            $data = array_merge(array($last_key => $last_value), $data);
        } elseif ('reg' == $url || 'app/appWebReg' == $url) {
            unset($data['certif_tp']);
        }

        return implode('|', $data);
    }

    public static function pinjieRsaverify($data)
    {
        ksort($data);
        $unset_keys = array(
            'url',
            'signature',
            'resp_desc',
            'artif_nm',
        );
        if (in_array($data['url'], array('changeMobile', 'authConfig', 'changeCard2'))) {
            $unset_keys = array(
                'url',
                'signature',
                'artif_nm',
            );
        }

        foreach ($unset_keys as $key => $value) {
            if (array_key_exists($value, $data)) {
                unset($data[$value]);
            }
        }
        return implode('|', $data);
    }

    /**
     * [xmlObject xml转对象]
     * @param  [xml] $xml [待处理的xml数据]
     * @return [object]      [返回对象]
     */
    public static function xmlObject($xml)
    {
        $string = simplexml_load_string($xml);
        $json = json_encode($string);
        $object = json_decode($json);
        return $object;
    }

    public static function log($url, $code, $data, $pinjie)
    {
        $msg_arr = [
            '0000' => '交易成功',
            1000 => '系统异常',
            1001 => '无此用户',
            1002 => '用户未激活',
            1003 => '用户已锁定',
            1004 => '无签约信息，不能发起扣款',
            1005 => '暂不支持的银行卡',
            1006 => '用户状态异常',
            1007 => '未知用户',
            1008 => '短信发送过于频繁，请稍后再试',
            1009 => '系统异常',
            1014 => '无效卡号(无此卡号)',
            1042 => '转入卡号或户名错误',
            1051 => '银行卡余额小于付款金额，交易失败',
            1101 => '无此商户',
            1102 => '商户已关闭',
            1103 => '商户已锁定',
            2000 => '正常账户',
            2001 => '无此账户',
            2002 => '账户未激活',
            2003 => '账户已锁定',
            2004 => '账户已冻结',
            2005 => '账户状态异常',
            2006 => '账户状态异常',
            2007 => '账户状态异常',
            2008 => '账户状态异常',
            2010 => '账户状态异常',
            2011 => '账户状态异常',
            2012 => '账户状态异常',
            2013 => '账户状态异常',
            2014 => '账户状态异常',
            2015 => '账户状态异常',
            2016 => '账户状态异常',
            2017 => '账户状态异常',
            2018 => '账户状态异常',
            2019 => '交易币种不符',
            2020 => '暂不支持',
            2030 => '贷记账户状态正常',
            2031 => '无此贷记账户',
            2032 => '贷记账户未激活',
            2033 => '贷记账户已锁定',
            2034 => '贷记账户已冻结',
            2035 => '贷记账户已销户',
            2036 => '贷记账户已过期',
            2037 => '贷记账户已挂失',
            2038 => '贷记账户状态不正常',
            2039 => '借贷记账记不属于同一个机构',
            2040 => '怀疑作弊',
            2041 => '怀疑作弊',
            2101 => '怀疑作弊',
            2102 => '怀疑作弊',
            2103 => '安全验证错误',
            2104 => '安全验证错误',
            2105 => '查询密码错误',
            2106 => '支付密码错误',
            2107 => '查询密码错误次数超限',
            2108 => '支付密码错误次数超限',
            2109 => '格式错',
            3001 => '功能暂不支持',
            3002 => '功能暂不支持',
            3003 => '安全验证错误',
            3004 => '功能暂不支持',
            3005 => '功能暂不支持',
            3006 => '功能暂不支持',
            3007 => '功能暂不支持',
            3011 => '交易金额太大',
            3012 => '金额无效',
            3013 => '余额不足',
            3014 => '余额不足',
            3015 => '余额不足',
            3016 => '余额不足',
            3017 => '余额不足',
            3018 => '余额不足',
            3019 => '交易金额太小',
            3020 => '余额不足',
            3021 => '余额不足',
            3022 => '交易金额太小',
            3023 => '余额不足',
            3024 => '金额太大',
            3101 => '找不到原交易',
            3102 => '原交易不成功',
            3103 => '原交易已冲正',
            3104 => '原交易已撤消',
            3105 => '原交易已完成',
            3106 => '原交易已冻结',
            3107 => '原交易已解冻',
            3108 => '原交易金额不符',
            3109 => '原交易账号不符',
            3110 => '找不到原始授权交易',
            3111 => '原交易状态异常',
            3112 => '原交易状态异常',
            3120 => '系统异常',
            3121 => '商户不匹配',
            3122 => '交易已完成',
            3123 => '卡号不匹配',
            3124 => '金额超限',
            3125 => '金额不一致',
            3126 => '终端号不一致',
            3127 => '隔日交易，无法完成',
            3201 => '记账失败',
            3251 => '提现账户未指定',
            3252 => '商户信息不完整',
            3253 => '格式错',
            3271 => '交易超时',
            3272 => '交易超时',
            4001 => '不允许开此账户',
            4002 => '不允许开此账户',
            4003 => '系统异常',
            4004 => '不允许开此账户',
            4005 => '不允许开此账户',
            4006 => '系统异常',
            4007 => '系统异常',
            4008 => '系统异常',
            4009 => '不支持的开户方式',
            4010 => '不支持的开户方式',
            4011 => '不支持的开户方式',
            4012 => '系统异常',
            4013 => '不可重复开户',
            5001 => 'session超时',
            5002 => '验签失败',
            5013 => '无此交易权限',
            5017 => '未做任何修改',
            5018 => '根据地区代码和行别找不到对应支行',
            5019 => '数据校验失败',
            5029 => '调用交易查询接口过于频繁',
            5098 => '银行系统或通讯异常',
            5100 => '用户会话已失效请在半小时内及时完成订单',
            5101 => '支付渠道选择有误支付渠道选择有误',
            5102 => '目标机构配置有误目标机构配置有误',
            5110 => '用户名或密码错误',
            5119 => '订单号重复',
            5137 => '账户信息不能修改',
            5123 => '订单重复支付请不要重复提交订单',
            5127 => '订单前后金额不一致订单前后金额不一致，金额可能被恶意篡改',
            5128 => '订单尚未完成付款',
            5138 => '银行系统或通讯异常',
            5143 => '验证码错误',
            5183 => '商户手续费不足',
            5239 => '商户不存在',
            5336 => '原交易找不到',
            5343 => '用户已开户',
            5344 => '账务系统开户失败',
            5345 => '商户流水号重复',
            5346 => '商户流水号不存在',
            5347 => '与商户系统日期不一致',
            5348 => '交易用户不存在',
            5349 => '找不到原交易',
            5350 => '指令提交模式只支持富友余额支付',
            5351 => '商户提现流水号重复',
            5352 => '未找到该商户交易记录',
            5353 => '接收FAS报文出现异常',
            5354 => 'FAS报文验签失败',
            5355 => '发送FAS通讯出现异常',
            5356 => '该卡号已认证',
            5357 => '该卡号已经受理且认证通过',
            5358 => '该卡号已经受理,但尚未认证通过',
            5359 => '该卡号尚未签约',
            5360 => '银行卡已签约',
            5460 => '发送日切通知失败',
            5505 => '不支持的银行卡',
            5555 => '交易确定超时',
            5556 => '用户信息修改期间不能代扣充值或提现',
            5557 => '用户未授权',
            5836 => '不允许信用卡注册',
            5837 => '卡号和行别不一致',
            5850 => '已经存在相同银行卡号注册的用户',
            5851 => '已经存在相同证件号注册的用户',
            5852 => '实名验证失败',
            5853 => '商户IP不允许访问',
            5854 => '协议库验证日期超过7天',
            5855 => '该手机号绑定卡号超过2张(在代收付系统解约)',
            5856 => '无权限访问该接口',
            5857 => '验证次数超限',
            5891 => '用户已开户',
            5901 => '查询范围只允许在31填内或31天前',
            5996 => '抱歉，该交易不被允许',
            6901 => '单笔金额超限单笔金额超限',
            6902 => '当日累计金额超限当日累计金额超限',
            8010 => '获取验证码失败',
            8143 => '订单支付失败，验证码失效或错误',
            9000 => '系统异常',
            9001 => '系统异常',
            9002 => '系统异常',
            9003 => '机构已关闭',
            9004 => '机构状态异常',
            9005 => '系统异常',
            9006 => '系统异常',
            9007 => '系统异常',
            9008 => '系统异常',
            9009 => '系统异常',
            9010 => '系统异常',
            9011 => '系统异常',
            9012 => '系统异常',
            9013 => '系统异常',
            9014 => '系统异常',
            9015 => '系统异常',
            9016 => '系统异常',
            9701 => '系统异常',
            9801 => '系统异常',
            9802 => '系统异常',
            9803 => '系统异常',
            9804 => '系统异常',
            9805 => '系统异常',
            9806 => '系统异常',
            9901 => '系统异常',
            9902 => '系统异常',
            10029 => '金额超限',
            55137 => '证件类型为空或者内容不正确',
            100011 => '卡号或者户名不符',
            100016 => '金额超限',
            100017 => '余额不足',
            100029 => '金额超限',
            100042 => '订单支付失败，手机号不符',
            100044 => '密码输入错误次数超限',
            210001 => '系统异常',
            210002 => '系统异常',
            100012 => '银行卡信息有误，验证失败。信息有误的情况下，大部分银行为防止套银行卡信息，不会返回具体是什么要素有问题。',
            100013 => '银行卡信息有误，验证失败。信息有误的情况下，大部分银行为防止套银行卡信息，不会返回具体是什么要素有问题。',
            999998 => '交易失败，详情请咨询您的发卡行',
            1010 => '错误次数超限，请核对卡信息稍后再试',
            1040 => '请求的功能尚不支持',
            5185 => '订单已支付',
            8110 => '验证码验证次数超限',
            9999 => '证件号必须为15或者18位',
            '0001' => '发送失败',
            '0020' => '手机号信息非法',
            '0021' => '订单号重复',
            '0030' => '报文内容信息非法',
            '10FE' => '贷记卡单笔交易金额超限',
            '10M1' => '超出借记卡同商户单日交易累计金额限额',
            '10M2' => '超出借记卡同商户当月累计金额限制',
            '10SM' => '超过金额限制',
            '51B3' => '订单支付中，请勿重复支付',
            '10XC' => '户名或证件号码不符',
            1061 => '银行卡设置了取款/转账限额，限额小于付款金额，交易失败',
            1096 => '银行系统异常',
            '10FC' => '单笔付款金额小于富友设置的最低交易限额，交易失败',
            '10FD' => '同卡金额超限',
            '10FB' => '同卡笔数超限',
            '10HA' => '商户电子凭条未经审核',
            '10M2' => '累计付款金额大于富友设置的月交易限额上限，交易失败',
            '10SM' => '单笔付款金额大于富友设置的最高交易限额，交易失败',
            999999 => '请求的功能尚不支持',
            200012 => '报文格式错误',
            200013 => '持卡人身份信息或手机号与银行预留不一致，或未开通银联在线功能',
            200014 => '银行卡未开通银联在线功能或为不支持的卡',
            200015 => '卡状态不正常',
            200016 => '无效卡',
            200017 => '银行卡账户余额不足',
            200023 => '银联风险受限',
            200029 => '交易金额超限',
            200098 => '交易超时',
        ];
        $msg = $msg_arr[$code];
        Log::useDailyFiles(storage_path() . '/logs/fuiou.log');
        Log::error([$url, $code, $msg, $data, $pinjie]);

        return [
            'code' => $code,
            'msg' => $msg,
        ];
    }
}
